
import sqlite3
from scansion import Scansion

s = Scansion(sqlite3.connect('aruuz.db'))
poem = """
ملا جو موقع تو روک دوں گا جلال روزِ حساب تیرا
پڑھوں گا رحمت کا وہ قصیدہ کہ ہنس پڑے گا عتاب تیرا
یہی تو ہیں دو ستُونِ محکم انہی پہ قائم ہے نظمِ عالم
یہی تو ہے رازِ خُلد و آدم نگاہ میری شباب تیرا
شمیمِ دوشیزگی میں کیسا بسا ہوا ہے شباب تیرا
تمام محفل کے رو برو گو اُٹھائیں نظریں ملائیں آنکھیں
سمجھ سکا ایک بھی نہ لیکن سوال میرا جواب تیرا
ہزار شاخیں ادا سے لچکیں ہوا نہ تیرا سا لوچ پیدا
شفق نے کتنے ہی رنگ بدلے ملا نہ رنگِ شباب تیرا
اِدھر مرا دل تڑپ رہا ہے تری جوانی کی جستجو میں
اُدھر مرے دل کی آرزو میں مچل رہا ہے شباب تیرا
کرے گی دونوں کا چاک پردہ رہے گا دونوں کو کر کے رُسوا
یہ شورِشِ ذوقِ دید میری یہ اہتمامِ حجاب تیرا
جڑیں پہاڑوں کی ٹوٹ جاتیں فلک تو کیا عرش کانپ اُٹھتا
اگر میں دل پر نہ روک لیتا تمام زورِ شباب تیرا
بھلا ہوا جوش نے ہٹایا نگاہ کا چشمِ تر سے پردہ
بَلا سے جاتی رہیں گر آنکھیں کھُلا تو بندِ نقاب تیرا
"""
print(s.scan_poem(poem))
